## Python Libraries - Pandas - Pandas Basics

Pandas is a library built using NumPy specifically for data analysis. You'll be using Pandas heavily for data manipulation, visualisation, building machine learning models, etc. 

There are two main data structures in Pandas:
- Series
- Dataframes 

The default way to store data is dataframes, and thus manipulating dataframes quickly is probably the most important skill set for data analysis.

In [1]:
# import pandas, pd is an alias
import pandas as pd

### The Pandas Series 

A series is similar to a 1-D numpy array, and contains scalar values of the same type (numeric, character, datetime etc.). 
A dataframe is simply a table where each column is a pandas series.

In [2]:
# Creating a numeric pandas series
s = pd.Series([2, 4, 5, 6, 9])
print(s)
print(type(s))

0    2
1    4
2    5
3    6
4    9
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
# creating a series of type datetime
date_series = pd.date_range(start = '11-09-2017', end = '12-12-2017')
date_series
type(date_series)

pandas.core.indexes.datetimes.DatetimeIndex

Note that each element in the Series has an index, and the index starts at 0 as usual.

### The Pandas Dataframe 

Dataframe is the most widely used data-structure in data analysis. It is a table with rows and columns, with rows having an index and columns having meaningful names.

There are various ways of creating dataframes, such as creating them from dictionaries, JSON objects, reading from txt, CSV files, etc.

#### Creating dataframes from dictionaries

In [4]:
# Defining data to create lists for dictionary
cars_per_cap = [809, 731, 588, 18, 200, 70, 45]
country = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
drives_right = [False, True, True, True, False, False, False]

In [5]:
# Creating the dictionaries to store the entries as key-value pair.
cars_dict = {"cars_per_cap" : cars_per_cap, "country" : country, "drives_right" : drives_right }

# Create the dataframe 'cars'
cars = pd.DataFrame(cars_dict)

In [6]:
# print the created dataframe
print(cars)

   cars_per_cap        country  drives_right
0           809  United States         False
1           731      Australia          True
2           588          Japan          True
3            18          India          True
4           200         Russia         False
5            70        Morocco         False
6            45          Egypt         False

#### Importing CSV data files as pandas dataframes 

For the upcoming exercises, we will use a car dataset which holds the following information:

- Region Code 
- Country
- Coutry Code
- Car per capita
- Drives Right

In [8]:
# read the data from the csv file
cars = pd.read_csv('marks_1.csv', sep='|')

# check the dataframe created
cars

     1   Akshay  Mathematics  50  40  80
0    2   Mahima      English  40  33  83
1    3    Vikas  Mathematics  50  42  84
2    4  Abhinav      English  40  31  78
3    5   Mahima      Science  50  40  80
4    6   Akshay      Science  50  49  98
5    7  Abhinav  Mathematics  50  47  94
6    8    Vikas      Science  50  40  80
7    9  Abhinav      Science  50  47  94
8   10    Vikas      English  40  39  98
9   11   Akshay      English  40  35  88
10  12   Mahima  Mathematics  50  43  86

As you can see from the dataframe above, the first row has been taken as the column header for the dataframe. Let's see how to prevent that.

In [10]:
# load the dataframe from the csv without any header
cars = pd.read_csv('marks_1.csv', sep='|', header=None)

# check the dataframe createdcars
cars

     0        1            2   3   4   5
0    1   Akshay  Mathematics  50  40  80
1    2   Mahima      English  40  33  83
2    3    Vikas  Mathematics  50  42  84
3    4  Abhinav      English  40  31  78
4    5   Mahima      Science  50  40  80
5    6   Akshay      Science  50  49  98
6    7  Abhinav  Mathematics  50  47  94
7    8    Vikas      Science  50  40  80
8    9  Abhinav      Science  50  47  94
9   10    Vikas      English  40  39  98
10  11   Akshay      English  40  35  88
11  12   Mahima  Mathematics  50  43  86

Now, the columns have the labels as 0, 1, 2, etc. The top row is now considered as a part of the row entries.

## Python Libraries - Pandas - Rows and Columns

### Indices and Labels

#### Indices 

An important concept in pandas dataframes is that of *row indices*. By default, each row is assigned indices starting from 0, and are represented at the left side of the dataframe. 

Now, arbitrary numeric indices are difficult to read and work with. Thus, you may want to change the indices of the dataframe to something more meanigful.

Let's change the index to the second column which stores the country codes, so that you can select rows using the country code directly.

In [17]:
# load the data into a dataframe with no header and index column as the second column
cars = pd.read_csv('marks_1.csv', sep='|', header=None, index_col=1)

# Check the created dataframe
cars

          0            2   3   4   5
1
Akshay    1  Mathematics  50  40  80
Mahima    2      English  40  33  83
Vikas     3  Mathematics  50  42  84
Abhinav   4      English  40  31  78
Mahima    5      Science  50  40  80
Akshay    6      Science  50  49  98
Abhinav   7  Mathematics  50  47  94
Vikas     8      Science  50  40  80
Abhinav   9      Science  50  47  94
Vikas    10      English  40  39  98
Akshay   11      English  40  35  88
Mahima   12  Mathematics  50  43  86

In [18]:
# Print the label of the index column
cars.index.name

1

In [19]:
# Remove the label of the index column
del cars.index.name

In [20]:
# Check the created dataframe
cars

          0            2   3   4   5
Akshay    1  Mathematics  50  40  80
Mahima    2      English  40  33  83
Vikas     3  Mathematics  50  42  84
Abhinav   4      English  40  31  78
Mahima    5      Science  50  40  80
Akshay    6      Science  50  49  98
Abhinav   7  Mathematics  50  47  94
Vikas     8      Science  50  40  80
Abhinav   9      Science  50  47  94
Vikas    10      English  40  39  98
Akshay   11      English  40  35  88
Mahima   12  Mathematics  50  43  86

Having meaningful row labels as indices helps you to select (subset) dataframes easily. You will study selecting dataframes in the next section. Let's now try to change the column headers.

#### Column headers

In [16]:
# Print the column headers of the dataframe
cars.columns

Int64Index([0, 1, 3, 4, 5], dtype='int64')

In [22]:
# Change the label of each column

cars.columns=['S.No.','Subject','Max Marks','Obtained Marks','Percentage']
# Check the created dataframe
cars

         S.No.      Subject  Max Marks  Obtained Marks  Percentage
Akshay       1  Mathematics         50              40          80
Mahima       2      English         40              33          83
Vikas        3  Mathematics         50              42          84
Abhinav      4      English         40              31          78
Mahima       5      Science         50              40          80
Akshay       6      Science         50              49          98
Abhinav      7  Mathematics         50              47          94
Vikas        8      Science         50              40          80
Abhinav      9      Science         50              47          94
Vikas       10      English         40              39          98
Akshay      11      English         40              35          88
Mahima      12  Mathematics         50              43          86

Without the labels, it will be very difficult to remember the information stored in the columns. Now you can easily make sense from the entries stored in the dataframe. Let's now try to define multiple indices in a dataframe.

#### Multi-indexing in Pandas

In [24]:
# Import the data from a csv file with multiple indices
cars = pd.read_csv('marks_1.csv', sep='|', header=None, index_col=[1,0])

# Check the created dataframe
cars

                      2   3   4   5
1       0
Akshay  1   Mathematics  50  40  80
Mahima  2       English  40  33  83
Vikas   3   Mathematics  50  42  84
Abhinav 4       English  40  31  78
Mahima  5       Science  50  40  80
Akshay  6       Science  50  49  98
Abhinav 7   Mathematics  50  47  94
Vikas   8       Science  50  40  80
Abhinav 9       Science  50  47  94
Vikas   10      English  40  39  98
Akshay  11      English  40  35  88
Mahima  12  Mathematics  50  43  86

In [26]:
# Change the column names as above
cars.columns=['Subject','Max Marks','Obtained Marks','Percentage']

# Check the created dataframe
cars

                Subject  Max Marks  Obtained Marks  Percentage
1       0
Akshay  1   Mathematics         50              40          80
Mahima  2       English         40              33          83
Vikas   3   Mathematics         50              42          84
Abhinav 4       English         40              31          78
Mahima  5       Science         50              40          80
Akshay  6       Science         50              49          98
Abhinav 7   Mathematics         50              47          94
Vikas   8       Science         50              40          80
Abhinav 9       Science         50              47          94
Vikas   10      English         40              39          98
Akshay  11      English         40              35          88
Mahima  12  Mathematics         50              43          86

In [27]:
# Print the index labels
cars.index.names = ['Name','S.No.']

In [ ]:
# Change the index labels: 0 - Region_code, 1 - Country_code


# Check the created dataframe

In [28]:
# Print the inforamtion of the index in the dataframe
cars.index.names

FrozenList(['Name', 'S.No.'])

Multi-indexing is very useful to establish a hierarchy in the entries. It helps to segregate data into different categories and makes it easier to analyse the data.